[
  {
    "id": 17635817,
    "title": "Digital Preservation as a Dependency",
    "authors": "Cirella, David, Manton, Jonathan",
    "abstract": "<p>Yale Library is integrating digital access and preservation through a stewardship model that prioritizes sustainability, usability, and ethical practices. This presentation explores how access systems, workflows, and stakeholder needs are supported through policy, custom development, and infrastructure planning to ensure long-term discoverability and preservation of digital special collections.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17635817",
    "download_link": "https://zenodo.org/api/records/17635817/files/DLF 2025 Presentation.pdf/content"
  },
  {
    "id": 17636285,
    "title": "Inclusive description? In this political climate?",
    "authors": "Beck, Emma, Wright, Challen",
    "abstract": "",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17636285",
    "download_link": "https://zenodo.org/api/records/17636285/files/T21_ Inclusive description_ In this political climate_.pptx/content"
  },
  {
    "id": 17636451,
    "title": "DAM'ed if You Do, DAM'ed if You Don't: Using Generative AI to Support a Digital Asset Manager Migration",
    "authors": "Miessler, R.C.",
    "abstract": "<p>Gettysburg College's Musselman Library undertook a migration from CONTENTdm to AM Quartex, but the library did not have coding or development support to leverage the CONTENTdm API. Instead, ChatGPT was used to develop Python scripts to automate certain aspects of the migration, generally successfully.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17636451",
    "download_link": "https://zenodo.org/api/records/17636451/files/miessler_dlf_2025_zenodo.pdf/content"
  },
  {
    "id": 17634480,
    "title": "Hire Learning: Reducing Accessibility Work Burnout with Methodical Student Employee Hiring",
    "authors": "Birchmeier, Bryan",
    "abstract": "<p>An overview of accessibility initiatives at the University of Michigan libraries which employ students with specific, complementary skills to address remediation of content, alleviate workload, and address accessibility gaps present at the libraries.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17634480",
    "download_link": "https://zenodo.org/api/records/17634480/files/Hire Learning - DLF Forum 2025 - Bryan Birchmeier.pptx/content"
  },
  {
    "id": 17625701,
    "title": "Stitching Stories: Bringing Material Cultures Into the Digital Humanities",
    "authors": "Ismail, Mariam",
    "abstract": "<p>The 23/54 Project preserves the legacy of a 1947 education lawsuit in Appalachia, Virginia, through a community quilt. This presentation explores how 3D scanning and an interactive digital exhibit expand the quilt&rsquo;s reach, integrating material culture into digital humanities while engaging descendant families, communities, and students in the process.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17625701",
    "download_link": "https://zenodo.org/api/records/17625701/files/Stitching Stories DLF Forum 2025.pdf/content"
  },
  {
    "id": 17619819,
    "title": "Agile Documentation Development for Digital Preservation Systems",
    "authors": "Baginski, Alisha, Glover, Sarah, Griffin, Melanie, Jewell, Andrew",
    "abstract": "<p>How can you efficiently and effectively create all of the documentation needed to support the sustainable implementation and use of your digital preservation systems and tools? Join this panel for a spirited discussion about how a team of digital preservation practitioners implemented a lightweight Agile approach to documentation development.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17619819",
    "download_link": "https://zenodo.org/api/records/17619819/files/DLF 2025 Agile Documentation.pptx/content"
  },
  {
    "id": 17613391,
    "title": "Nuclear Planning and Preparedness: Curating Documentary Production Collections on the Atomic West for the CU Digital Library",
    "authors": "Velte, Ashlyn, Wagner, Jamie",
    "abstract": "<p>CU Boulder Libraries&rsquo; archivists share their experiences selecting and preparing digital collections from original documentary production material about nuclear activity in the American west. They will present challenges in balancing the needs of activist stakeholders, approaches to legal and ethical considerations, and strategies for complex archival media production collections.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17613391",
    "download_link": "https://zenodo.org/api/records/17613391/files/DLF2025_Nuclear Planning and preparedness_VelteWagner.pptx/content"
  },
  {
    "id": 17623224,
    "title": "Experiences and Advice from the Institutional Perspective of a Consortium-Based Digital Collection Management System Migration",
    "authors": "Miller, Evan",
    "abstract": "<div>\n<div>System migrations take time and energy; however, this is not always the reality for institutions, especially with consortium-supported systems. Sharing takeaways and practical examples from a digital collection management system migration, the presenter will discuss how an archives can assess its collections and remediate metadata efficiently and effectively under a prescribed timeline.</div>\n</div>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17623224",
    "download_link": "https://zenodo.org/api/records/17623224/files/2025-11-19_DLF_ForumPresentation.pdf/content"
  },
  {
    "id": 17604472,
    "title": "Why keep data science local? Case Studies from Two Universities Building Scholarly Indices with Open Data to Improve Institutional Data Literacy",
    "authors": "Teykl, Katharine, Hemingway, Jordan, Clark, Jason, Hutchens, Chad",
    "abstract": "<p>Two mid-sized libraries created indices of institutional scholarship using open code and the OpenAlex dataset. This panel explores the implementation of these applications, examines the open data sources used, and offers a candid discussion on what is gained and lost when choosing to outsource data science research and development.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17604472",
    "download_link": "https://zenodo.org/api/records/17604472/files/w18_why_keep_data_science_local_dlf2025.pdf/content"
  },
  {
    "id": 17604224,
    "title": "OpenAlex Python Toolkit for Librarians",
    "authors": "Teykl, Katharine, Hutchens, Chad",
    "abstract": "<p>This workshop will focus on using Python to retrieve institutionally affiliated bibliometric data (e.g. articles, datasets, books, etc.) from the OpenAlex API. Participants will be supplied with pre-written Python code that can be run from Google Colab to generate reports and data visualizations of research outputs from their organization.&nbsp;</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17604224",
    "download_link": "https://zenodo.org/api/records/17604224/files/dlf_teach_teykl_hutchens.pdf/content"
  },
  {
    "id": 17594695,
    "title": "Curating Digital Exhibits in Community Archives",
    "authors": "Matusiak, Krystyna, Han, Ruohua",
    "abstract": "<p><span>Digital exhibits, a digital genre built on the tradition of physical displays in museums and libraries, have been adopted in digital libraries, humanities projects, and community archives. Digital exhibits can provide new ways of promoting digitized collections and offer the potential to address archival silences and tell the stories of underrepresented groups. While the role and structure of digital exhibits have been explored in the context of academic institutions and public libraries, there is no research examining the methods of creating digital exhibits in local community archives. This presentation will discuss approaches to curating digital exhibits in community archives by using the Park County Local History Archives (PCLHA) as a case. PCLHA is a community archive located in a rural area of Colorado. Its </span><a href=\"https://pclha.cvlcollections.org\"><span>Digital Archive</span></a><span> features </span><a href=\"https://pclha.cvlcollections.org/exhibits/\"><span>five digital exhibits</span></a><span> about different aspects of local history, immigrant communities, and everyday life. The exhibits were built in collaboration with the University of Denver&rsquo;s Library and Information Science program. This case illustrates the ways that digital exhibits can provide opportunities for acknowledging and addressing absences, extending coverage, and documenting almost forgotten stories. We will also present additional findings based on analyzing the content of selected exhibits and interviewing people involved in creating them. These findings explore approaches to selecting topics, methods used for constructing narratives, and strategies for presenting social justice topics. The presentation aims to enhance the understanding of the process of creating digital exhibits in local community archives, especially in terms of how to uplift the histories of marginalized communities.<span>&nbsp; </span></span></p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17594695",
    "download_link": "https://zenodo.org/api/records/17594695/files/Matusiak_Han_2025 DLF Forum.pptx/content"
  },
  {
    "id": 17636438,
    "title": "Digitizing NYC Mayor David Dinkins Photographs",
    "authors": "Sarah Cuk",
    "abstract": "<p><span lang=\"EN-US\"><span>I&nbsp;</span><span>describe</span> <span>digitizing</span> <span>photographic negatives</span> <span>from </span><span>the Mayor David Dinkins administration </span><span>(1990</span><span>-</span><span>1993) </span><span>at the N</span><span>YC</span><span> Municipal Archives</span><span>. </span><span>Unlike</span><span> typical workflows </span><span>where</span><span> records are digitized </span></span><span lang=\"EN-US\"><span>once</span> <span>processed, </span></span><span lang=\"EN-US\"><span>I</span><span>&rsquo;m</span> <span>simultaneously </span><span>processing, digitizing, and describing</span><span>. </span><span>Th</span><span>is </span><span>maintain</span><span>s</span><span> consistency so that everything is standardized</span><span> and ready for</span> <span>members of </span><span>Dinkins&rsquo; Administration</span> <span>to </span><span>transcr</span><span>ibe</span><span>.</span></span><span>&nbsp;</span></p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17636438",
    "download_link": "https://zenodo.org/api/records/17636438/files/DLF_Digitizing-David-Dinkins_Cuk.pptx/content"
  },
  {
    "id": 17632867,
    "title": "Evolving Roles and Tools: Navigating the Future of Project Management in Digital Libraries",
    "authors": "Lovins, Cari",
    "abstract": "<p>As digital library work grows in complexity, so must our approaches to managing it. This workshop will explore the evolving landscape of project management in the digital library space, including incorporating AI tools, adapting to economic constraints, and transitioning from traditional project management to broader program and service management roles.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17632867",
    "download_link": "https://zenodo.org/api/records/17632867/files/EvolvingRolesandToolsPM_LearnDLF2025.pdf/content"
  },
  {
    "id": 17624237,
    "title": "Mixed-Methods Approaches for Reformatting Projects at Scale: a Case Study",
    "authors": "Gottlieb-Miller, Lauren, Smith, Marian, Stakes, Austin",
    "abstract": "<p>This presentation explores the digitization of The Daily Cougar, UH&rsquo;s student newspaper in publication since 1928. Using a mixed-methods approach involving microfilm digitization, in-house digitization, and born-digital preservation, we discuss project management, stakeholder collaboration, and lessons for large-scale complex digitization initiatives.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17624237",
    "download_link": "https://zenodo.org/api/records/17624237/files/DLF W24 Mixed Methods.pdf/content"
  },
  {
    "id": 17575431,
    "title": "The Data Den: Creating Space for Data, Discovery, and Community",
    "authors": "Hight, Alexa",
    "abstract": "<p>After two successful datathons, we recognized the need for a dedicated, inclusive space for data work. The Data Den was born: transforming a traditional library instruction lab into a collaborative hub for students from all disciplines.</p>",
    "year": 2025,
    "doi": "https://doi.org/10.5281/zenodo.17575431",
    "download_link": "https://zenodo.org/api/records/17575431/files/Hight_DLF_LightningTalks.pptx/content"
  }
]