[
  {
    "name": "AM Quartex",
    "url": "https://www.amdigital.co.uk/",
    "info": "AM's digital collections and technology platforms enrich the study, research and teaching of primary sources. AM works with libraries, archives and heritage institutions to digitise the world's historical and cultural knowledge. Developed to present AM's own primary source collections, Quartex helps customers bring archival materials to life.",
    "logo": "/static/sponsors/AM_Quartex.png",
    "level": "Platinum"
  },
  {
    "name": "Digital Scholar",
    "url": "https://digitalscholar.org",
    "info": "Committed to the responsible stewardship of critical open-source infrastructure for the digital humanities, Digital Scholar sustains a growing family of software projects, including Omeka, Zotero, Tropy, PressForward, and Sourcery.",
    "logo": "/static/sponsors/digital-scholar-logo.svg",
    "level": "Platinum"
  },
  {
    "name": "Discovery Garden",
    "url": "https://www.discoverygarden.com",
    "info": "Reimagining institutional repositories and digital collections. We build and run outstanding institutional repositories and digital collections for libraries, galleries, museums, and archives so they can organize and share their prized digital assets.",
    "logo": "/static/sponsors/dg-logo-darkblue.svg",
    "level": "Gold"
  },
  {
    "name": "4Science",
    "url": "https://4science.com/",
    "info": "4Science is a Certified Platinum Provider of DSpace and lead contributor to DSpace globally. We offer turnkey solutions for DSpace, DSpace extensions (DSpace-CRIS and DSpace-GLAM), and Dataverse.<br><br><strong>Services Offered</strong><br><ul class=\"text-left text-gray-700 text-sm mt-2 list-disc\"><li>DSpace SaaS and Cloud Hosting (Trusted with Cloud Security Alliance – CSA, ISO 27001:2022 certified)</li><li>On-Premises Support</li><li>Turn-key Solutions</li><li>Consultancy &amp; Training</li><li>Analysis &amp; Customization</li><li>Installation &amp; Configuration</li><li>Platform migrations and upgrades</li><li>Software Development &amp; Integration</li></ul>",
    "logo": "/static/sponsors/4science_blue_transparent.png",
    "level": "Silver"
  },
  {
    "name": "JSTOR",
    "url": "https://about.jstor.org/",
    "logo": "/static/sponsors/jstor.svg",
    "level": "Silver",
    "info": "Collection stewardship is increasingly complex, requiring institutions to juggle preservation, digital asset management, description and metadata creation, and access with limited resources. JSTOR Digital Stewardship Services solves these common collection management challenges. Developed in collaboration with librarians and archivists, JDSS integrates your digital assets, with AI-powered processing support, for increased discovery and long-term preservation, including sharing on JSTOR."
  },
  {
    "name": "Terentia",
    "url": "https://terentia.io/",
    "info": "Empowering cultural institutions. Terentia is the next-generation platform to manage collections, organize and preserve digital assets, and tell compelling stories. Purpose-built for the GLAMP sector, our cloud-native solution integrates digital asset management (DAM), collections management, and collections engagement into a flexible, user-friendly interface, powered by Microsoft Azure. Discover a more innovative way to streamline workflows and connect with diverse audiences.",
    "logo": "/static/sponsors/TERENTIA_LOGO_TEAL.png",
    "level": "Silver"
  },
  {
    "name": "TIND",
    "url": "https://www.tind.io/",
    "info": "TIND Digital Archive is a modern platform for managing, preserving, and showcasing digital collections. It combines flexible metadata handling with powerful discovery tools that make collections more visible and accessible. Secure hosting, dependable preservation workflows, and smooth migration from legacy systems ensure reliability, backed by responsive support and continuous development. TIND is an official CERN spin-off providing commercial library management systems, digital preservation, and research data management solutions based on CERN open-source software. Serving academic, public, and special research libraries around the globe, TIND is headquartered in Oslo, Norway.",
    "logo": "/static/sponsors/TIND_logo_blue.svg",
    "level": "Silver"
  },
  {
    "name": "AM Quartex",
    "url": "https://www.amdigital.co.uk/",
    "info": "",
    "logo": "/static/sponsors/AM_Quartex.png",
    "level": "Fellowships"
  },
  {
    "name": "MetaArchive",
    "url": "https://educopia.org/sponsee-profile/metaarchive-cooperative/",
    "info": "",
    "logo": "/static/metaArchive.png",
    "level": "Fellowships"
  }
]
